### 판다스 데이터 입출력

In [1]:
import pandas as pd

In [2]:
%%writefile data/sample1.csv
c1, c2,c3
1, 1.11, one 
2, 2.22, two
3, 3.33, three

Overwriting data/sample1.csv

- CSV 파일 입력

In [3]:
pd.read_csv('data/sample1.csv')

   c1    c2      c3
0   1  1.11    one
1   2  2.22     two
2   3  3.33   three

In [4]:
%%writefile data/sample2.csv
1, 1.11, one 
2, 2.22, two
3, 3.33, three

Overwriting data/sample2.csv

In [5]:
pd.read_csv('data/sample2.csv')

   1   1.11    one
0  2   2.22     two
1  3   3.33   three

In [6]:
# 데이터 파일에 열 인덱스 정보가 없는 경우에는 read_csv 명령의 names 인수로 설정할 수 있음
pd.read_csv('data/sample2.csv', names=['c1', 'c2', 'c3'])

   c1    c2      c3
0   1  1.11    one
1   2  2.22     two
2   3  3.33   three

In [7]:
# 테이블 내의 특정한 열을 행 인덱스로 지정하고 싶으면 index_col 인수를 사용
pd.read_csv('data/sample1.csv', index_col='c3')

        c1    c2
c3
 one     1  1.11
 two     2  2.22
 three   3  3.33

In [8]:
%%writefile data/sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Overwriting data/sample3.txt

In [9]:
# 데이터를 구분하는 구분자(separator)가 쉼표(comma)가 아니면 sep 인수를 써서 구분자를 사용자가 지정

In [10]:
# 길이가 정해지지 않은 공백이 구분자인 경우에는 \s+
pd.read_table('data/sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [11]:
df = pd.read_table('data/sample4.tvs', sep='\t')
df

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [12]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing sample5.csv

In [13]:
pd.read_csv('sample5.csv', na_values=['누락'])

    c1     c2      c3
0  1.0   1.11     one
1  2.0            two
2  NaN   3.33   three

- CSV 파일 출력

In [14]:
df

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [15]:
df.to_csv('data/sample6.csv')

In [16]:
# 행 인덱스가 파일에 쓰여져 있어 읽으면 엉뚱한 데이터가 나옴
pd.read_csv('data/sample6.csv')

   Unnamed: 0        c1        c2        c3       c4
0           0  0.179181 -1.538472  1.347553  0.43381
1           1  1.024209  0.087307 -1.281997  0.49265
2           2  0.417899 -2.002308  0.255245 -1.10515

In [17]:
# index, header 인수를 지정하여 인덱스 및 헤더 출력 여부를 지정하는 것도 가능
df.to_csv('data/sample7.csv', index=False)
pd.read_csv('data/sample7.csv')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

- 인터넷 상의 CSV 파일 입력

In [18]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [19]:
df.head()   # 5줄이 기본

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q